src/InformationRegisters/РаспоряженияНаОтгрузкуКВыполнению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспоряженияНаОтгрузкуКВыполнению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеКОформлению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКПередаче</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗаказано</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/РаспоряженияНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РаспоряженияНаОтгрузку</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПередаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияРегистра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияНакопления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/УдалитьЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УдалитьЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПередаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СостояниеОформленияДокументовПоРаспоряжению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостояниеОформленияДокументовПоРаспоряжению</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОформлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОформлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуются</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/РаспоряженияНаОтгрузкуКВыполнению/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РаспоряженияНаОтгрузкуКВыполнению.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.18.9";
	Обработчик.РежимВыполнения = "Отложенно"; 
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6c3251ac-f64a-4b70-a153-197feacb06c6");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспоряженияНаОтгрузкуКВыполнению.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет состояния открытых распоряжений в регистр распоряжения на отгрузку к выполнению'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.УдалитьЗаказыКлиентов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");  
	
	Изменяемые = Новый Массив;                                          
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуКВыполнению.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуКВыполнению.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");    
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.РаспоряженияНаОтгрузку.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.РаспоряженияНаОтгрузкуКВыполнению";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.РаспоряженияНаОтгрузкуКВыполнению");
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УдалитьЗаказыКлиентовОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	УдалитьЗаказыКлиентовОстатки.Склад КАК Склад,
	|	УдалитьЗаказыКлиентовОстатки.Номенклатура КАК Номенклатура,
	|	УдалитьЗаказыКлиентовОстатки.Характеристика КАК Характеристика,
	|	УдалитьЗаказыКлиентовОстатки.Серия КАК Серия
	|ПОМЕСТИТЬ ОстаткиЗаказов
	|ИЗ
	|	РегистрНакопления.УдалитьЗаказыКлиентов.Остатки КАК УдалитьЗаказыКлиентовОстатки
	|ГДЕ
	|	УдалитьЗаказыКлиентовОстатки.КОформлениюОстаток <> 0
	|	ИЛИ УдалитьЗаказыКлиентовОстатки.КПередачеОстаток <> 0
	|	ИЛИ УдалитьЗаказыКлиентовОстатки.ЗаказаноОстаток <> 0
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыКлиентов.Склад КАК Склад,
	|	ЗаказыКлиентов.ЗаказКлиента КАК Распоряжение
	|ИЗ
	|	ОстаткиЗаказов КАК ЗаказыКлиентов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспоряженияНаОтгрузкуКВыполнению КАК РаспоряженияНаОтгрузкуКВыполнению
	|		ПО ЗаказыКлиентов.ЗаказКлиента = РаспоряженияНаОтгрузкуКВыполнению.Распоряжение
	|		И ЗаказыКлиентов.Склад = РаспоряженияНаОтгрузкуКВыполнению.Склад
	|ГДЕ
	|	РаспоряженияНаОтгрузкуКВыполнению.Распоряжение ЕСТЬ NULL";
		
	РегистрируемыеЗаписи = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеЗаписи, ДополнительныеПараметры);
	Константы.УдалитьРаспоряженияНаОтгрузкуКВыполнениюНеЗаполнен.Установить(Истина);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрСведений.РаспоряженияНаОтгрузкуКВыполнению";
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта) Тогда 
		Параметры.ОбработкаЗавершена = Истина; 
		Константы.УдалитьРаспоряженияНаОтгрузкуКВыполнениюНеЗаполнен.Установить(Ложь);
		Возврат;       
	КонецЕсли;
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);   
	Запрос = Новый Запрос();  
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдалитьЗаказыКлиентовОбороты.ЗаказКлиента КАК Распоряжение,
	|	УдалитьЗаказыКлиентовОбороты.Склад КАК Склад,
	|	УдалитьЗаказыКлиентовОбороты.Номенклатура КАК Номенклатура,
	|	УдалитьЗаказыКлиентовОбороты.Характеристика КАК Характеристика,
	|	УдалитьЗаказыКлиентовОбороты.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА УдалитьЗаказыКлиентовОбороты.КОформлениюПриход = УдалитьЗаказыКлиентовОбороты.КОформлениюРасход
	|			ТОГДА 1
	|		КОГДА УдалитьЗаказыКлиентовОбороты.КОформлениюРасход = 0
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СостояниеКОформлению,
	|	ВЫБОР
	|		КОГДА УдалитьЗаказыКлиентовОбороты.КПередачеПриход = УдалитьЗаказыКлиентовОбороты.КПередачеРасход
	|			ТОГДА 1
	|		КОГДА УдалитьЗаказыКлиентовОбороты.КПередачеПриход > 0
	|				И УдалитьЗаказыКлиентовОбороты.КПередачеРасход = 0
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СостояниеКПередаче,
	|	ВЫБОР
	|		КОГДА УдалитьЗаказыКлиентовОбороты.ЗаказаноПриход = УдалитьЗаказыКлиентовОбороты.ЗаказаноРасход
	|			ТОГДА 1
	|		КОГДА УдалитьЗаказыКлиентовОбороты.ЗаказаноРасход = 0
	|				И УдалитьЗаказыКлиентовОбороты.ЗаказаноПриход > 0
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СостояниеЗаказано
	|ПОМЕСТИТЬ ВТСостоянияРаспоряжений
	|ИЗ
	|	РегистрНакопления.УдалитьЗаказыКлиентов.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента = &Распоряжение
	|			И Склад = &Склад) КАК УдалитьЗаказыКлиентовОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияРаспоряжений.Распоряжение КАК Распоряжение,
	|	СостоянияРаспоряжений.Склад КАК Склад,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Организация) КАК Организация,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Номер) КАК Номер,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Дата) КАК Дата,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.СуммаДокумента) КАК СуммаДокумента,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Валюта) КАК Валюта,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Партнер) КАК Партнер,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Контрагент) КАК Контрагент,
	|	МАКСИМУМ(СостоянияРаспоряжений.Распоряжение.Менеджер) КАК Менеджер,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеКОформлению) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.Оформлены)
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеКОформлению) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.НеОформлены)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.ЧастичноОформлены)
	|	КОНЕЦ КАК СостояниеКОформлению,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеКПередаче) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.Оформлены)
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеКПередаче) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.НеОформлены)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.ЧастичноОформлены)
	|	КОНЕЦ КАК СостояниеКПередаче,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеЗаказано) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.Оформлены)
	|		КОГДА МАКСИМУМ(СостоянияРаспоряжений.СостояниеЗаказано) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.НеОформлены)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.ЧастичноОформлены)
	|	КОНЕЦ КАК СостояниеЗаказано
	|ИЗ
	|	ВТСостоянияРаспоряжений КАК СостоянияРаспоряжений
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияРаспоряжений.Распоряжение,
	|	СостоянияРаспоряжений.Склад
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(СостоянияРаспоряжений.СостояниеКОформлению) > 1
	|		ИЛИ МАКСИМУМ(СостоянияРаспоряжений.СостояниеКПередаче) > 1
	|		ИЛИ МАКСИМУМ(СостоянияРаспоряжений.СостояниеЗаказано) > 1)"; 
	
	Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
		НаборЗаписей = Неопределено;
		Запрос.УстановитьПараметр("Распоряжение", Строка.Распоряжение);
		Запрос.УстановитьПараметр("Склад", Строка.Склад);
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.УдалитьЗаказыКлиентов");
			ЭлементБлокировки.УстановитьЗначение("ЗаказКлиента", Строка.Распоряжение);
			ЭлементБлокировки.УстановитьЗначение("Склад", Строка.Склад);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РаспоряженияНаОтгрузкуКВыполнению");
			ЭлементБлокировки.УстановитьЗначение("Склад", Строка.Склад);
			ЭлементБлокировки.УстановитьЗначение("Распоряжение", Строка.Распоряжение);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			//@skip-check query-in-loop
			ТаблицаНабора = Запрос.Выполнить().Выгрузить();
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Склад.Установить(Строка.Склад);
			НаборЗаписей.Отбор.Распоряжение.Установить(Строка.Распоряжение);
			НаборЗаписей.Загрузить(ТаблицаНабора);
	
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Если НаборЗаписей = Неопределено Тогда
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Склад.Установить(Строка.Склад);
				НаборЗаписей.Отбор.Распоряжение.Установить(Строка.Распоряжение);
			КонецЕсли;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), НаборЗаписей);
		КонецПопытки;
	КонецЦикла;    
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	Если Параметры.ОбработкаЗавершена Тогда
		Константы.УдалитьРаспоряженияНаОтгрузкуКВыполнениюНеЗаполнен.Установить(Ложь);
	КонецЕсли;
			
КонецПроцедуры        

#КонецОбласти

#КонецОбласти

#КонецЕсли
